[
  {
    "path": "posts/2021-06-13-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "SMU ISSS608 DataViz Makeover 2: Exploring different prespective on Merchandise Trade with Partnering Markets",
    "author": [
      {
        "name": "Hong, Yun Ting",
        "url": "https://www.linkedin.com/in/yuntinghong/"
      }
    ],
    "date": "2021-06-13",
    "categories": [],
    "contents": "\n1.0 Critiques on the original design\n1.1 Clarity\n1.2 Aesthetics\n2.0. Alternative Design\n2.1. Advantages of proposed design\n2.1.1 Clarity\n2.1.2 Aesthetics\n3.0. Proposed Data Visualization\n4.0. Data Visualisation Step-by-Step\n4.1. Data Preparation in Excel\n5.0. Final Visualization\n5.1. Snapshot of Graph\n5.2. Major Observation and/or derived Insights\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-13T22:21:18+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "SMU ISSS608 DataViz Makeover 1: \nData Visualization on Mechandise Trade by Region/Market",
    "author": [
      {
        "name": "Hong, Yun Ting",
        "url": "https://www.linkedin.com/in/yuntinghong/"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\n\nContents\n1.0 Critiques on the original design1.1 Clarity\n1.2 Aesthetics\n\n2.0. Alternative Design2.1. Advantages of proposed design\n\n3.0. Proposed Data Visualization\n4.0. Data Visualisation Step-by-Step4.1. Data Preparation in Excel\n4.2. Data Visualization in Tableau\n\n5.0. Final Visualization5.1. Snapshot of Graph\n5.2. Major Observation and/or derived Insights\n\n\n1.0 Critiques on the original design\nThis is the original design to illustrate Singapore’s Merchandise Trade with its Top Six Trading Countries from 2019 to 2020\n1.1 Clarity\nNo\nCritiques\nProposed Solution\n1\nTitle can be more informative - The title states what is the data showing, but it did not states what is the data is trying to portray\nCome out with a short description on what should the reader’s be expecting or gaining from the chart\n2\nInconsistent data used - Japan only shows Year 2020 data, whereas the other countries show data from Year 2019 to end of Year 2020\nData should be consistent throughout all countries for a fair comparison\n3\nUsing wrong type of chart - Area line chart is best used when there is at least 1 variable that represent a summation value\nSince ‘Import’ and Export’ are independent variables, I would recommend using line chart if we want to understand the trends.\n1.2 Aesthetics\nNo\nCritiques\nProposed Solution\n1\nNo focus area - There is no annotation or special colored data to indicate point of interest\nHighlight certain data to capture reader’s attention\n2\nX axis markers - X-axis title labeled Month of Period but the markers are only showing years\nShows the markers for months if the axis labeled months\n3\nTransparency of area chart - The opacity of the overlapping area is not prominent for both data to be seen clearly\nIncrease the transparency of ‘Import’ data\n2.0. Alternative Design\n\n2.1. Advantages of proposed design\n2.1.1 Clarity\nTitle tells a better story of what is to be expected from the graph and subtitle is used to annotate the overall chart.\nInstead of raw import and export data, this graph uses of Net Export formula (Export - Import) to illustrate the impact of Import and Export trades.\nAdded units to x axis label to indicate the data is a monetary value.\n2.1.2 Aesthetics\nAesthetically, a simple line chart shows a better trends between the 6 countries.\nColor coordinated, with red indicating negative figures (Trade Deficit) and blue indicating positive figures (Trade Surplus).\nAnnotation is used to highlight key points.\nEach line is accompanied with a country label instead of showing it as a separate legend.\nY axis is not divided into 6 segments, trends can be spotted with the level of granularity for the time period\n3.0. Proposed Data Visualization\nRaw data are available at DoSS, under sub-section of Merchandise Trade by Region/Market.\nActual Data Visualization can be viewed at Tableau Public here\n4.0. Data Visualisation Step-by-Step\n4.1. Data Preparation in Excel\nFilter out the 6 countries (Hong Kong, Mainland China, Japan, Malaysia, Taiwan and United States) from Import Worksheet. \nRetrieve data from Year 2019 Jan to Year 2020 Dec \nRepeat Step 1 and 2 again for Export worksheet\nConsolidate the data into a new worksheet \nTranspose data \nReorganize data into a new worksheet (Data), consisting only 4 columns (Period, Country, Import and Export) \n4.2. Data Visualization in Tableau\nImport the Excel Sheet into Tableau and select “Data” worksheet as Data Source\nChange Data Type\nChange ‘Period’ data type from String to Date\nChange ‘Import’ data type from String to Number (whole)\nChange ‘Export’ data type from String to Number (whole)\nCreate a calculate field to show Net Export\nUnder Analysis > ‘Create Calculated Field’ or Right Click on the left panel > ‘Create Calculated Field’\nInput Calculated Field ‘Net Export (S$)’ Formula:\nSUM([Import]) - SUM([Export])\nCreate a line chart to display Net Export from Year 2019 Jan to Year 2020 Dec\nDrag [Month(Period)] to Columns\nDrag [AGG(Net Export(S$))] to Rows\nSeparating Net Export data into Country level\nDrag [Country] into ‘Details’ and ‘Label’\nAdd colors to differentiate positive or negative net export\nDrag [AGG(Net Export(S$))] to ‘Color’ properties\nFormatting Colors\nOnce Step 5 is done, a color filter interface automatically appear in the right panel\nClick on the down arrow > Edit Colors…\nUnder Palette > Select ‘Red-Blue Diverging’\nCheck ‘Use Full Color Range’\nClick on Advance > Check Center and input 0 as the value\nAdd Annotation\nRight click on an empty space in the chart > Annotate > Area\n5.0. Final Visualization\n5.1. Snapshot of Graph\n\n5.2. Major Observation and/or derived Insights\nThere are 2 extreme trading trends gathered between Taiwan and Hong Kong.\nSingapore trading behavior with Taiwan within this period can assumed to have contributed to Singapore economic growth due to trade surplus. Taiwan main import goods are oil/petroleum and natural gas, in which happen to be Singapore main export goods. Taiwan main export goods are electrical equipment and machinery, however, Singapore are importing it more from other countries such as China, Malaysia and United States. Therefore, Singapore is importing less from Taiwan, and exporting more to Taiwan, creating trade surplus.\nOn the other hand, between 2019 to 2020, Singapore is experiencing trade deficit with Hong Kong. Hong Kong’s main exporting goods are electrical machinery, precious and minerals which Singapore needs. However, Hong Kong’s main imports goods are also machinery equipment which is largely provided by China and Singapore only stands a small percentage of the total export trade. This result in inflow of import goods exceeded the outflow of export goods and this create trade deficit.\nObservatory of Economic Complexity, 2019Singapore Import and Export data, 2019\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-30T19:12:18+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Hong, Yun Ting",
        "url": "https://www.linkedin.com/in/yuntinghong/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\n1.0 Overview\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\n2.0 Installing and Launching R Packages\nBefore you get started, you are required:\nto start a new R project, and\nsub-point\n\nto create a new R Markdown document.\nTo insert a graph,\n\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\nR code\npackages = c(‘ggpubr’, ‘tidyverse’)\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\n3.0 Importing and Preparing The Data Set\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\n3.1 Importing Data\nFirst, let us import the data into R by using read_csv() of readr package.\nR code\nwine <- read_csv(“data/wine_quality.csv”)\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\n4.0 Univariate EDA with Histogram\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\nRcode\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-30T15:38:29+08:00",
    "input_file": {}
  }
]
